//=============================================================================
//
// マネージャー処理 [manager.cpp]
// Author : 
//
//=============================================================================
#include "gamedata_keep_object.h"
#include "result.h"

//*****************************************************************************
// 静的メンバ変数宣言
//*****************************************************************************
int CGameDataKeepObject::m_nKeepScore = 0;
int CGameDataKeepObject::m_nKeepMaxCombo = 0;
int CGameDataKeepObject::m_nKeepKillEnemy = 0;
int CGameDataKeepObject::m_nTimer = 0;

//=============================================================================
// CGameDataKeepObjectのコンストラクタ
//=============================================================================
CGameDataKeepObject::CGameDataKeepObject()
{
	// メンバ変数の初期化
	m_nKeepScore = 0;
	m_nKeepMaxCombo = 0;
	m_nKeepKillEnemy = 0;
	m_nTimer = 0;
}

//=============================================================================
// CGameDataKeepObjectのデストラクタ
//=============================================================================
CGameDataKeepObject::~CGameDataKeepObject()
{

}

//=============================================================================
// 初期化処理
//=============================================================================
HRESULT CGameDataKeepObject::Init(void)
{
	// メンバ変数の初期化
	m_nKeepScore = 0;
	m_nKeepMaxCombo = 0;
	m_nKeepKillEnemy = 0;
	m_nTimer = 0;

	return S_OK;
}

//=============================================================================
// 終了処理
//=============================================================================
void CGameDataKeepObject::Uninit(void)
{

}

//=============================================================================
// 更新処理
//=============================================================================
void CGameDataKeepObject::Update(void)
{

}

//=============================================================================
// 描画処理
//=============================================================================
void CGameDataKeepObject::Draw(void)
{

}