//-------------------------------------------------------------------
//
// 背景ヘッダー (bg.h)
// Author:Itsuki Takaiwa
//
//-------------------------------------------------------------------
#ifndef _BG_H_
#define _BG_H_

#include "main.h"

//-------------------------------------------------------------------
// プロトタイプ宣言
//-------------------------------------------------------------------
HRESULT InitBg(void);		 // ポリゴンの初期化処理
void UninitBg(void);		 // ポリゴンの終了処理
void UpdateBg(void);		// ポリゴンの更新処理
void DrawBg(void);			// ポリゴンの描画処理
void SetVertexBg(int nCnt); // 頂点座標の設定

#endif