//-------------------------------------------------------------------
//
// リザルト背景ヘッダー (title.h)
// Author:Itsuki Takaiwa
//
//-------------------------------------------------------------------
#ifndef _RESULTBG_H_
#define _RESULTBG_H_

#include "main.h"

//-------------------------------------------------------------------
// プロトタイプ宣言
//-------------------------------------------------------------------
HRESULT InitResultBg(void);				// リザルト背景の初期化処理
void UninitResultBg(void);				// リザルト背景の終了処理
void UpdateResultBg(void);				// リザルト背景の更新処理
void DrawResultBg(void);				// リザルト背景の描画処理

#endif