//-------------------------------------------------------------------
//
// セットパーティクルヘッダー (setparticle.h)
// Author:Itsuki Takaiwa
//
//-------------------------------------------------------------------
#ifndef _SETPARTICLE_H_
#define _SETPARTICLE_H_

#include "main.h"

//-------------------------------------------------------------------
// セットパーティクルの種類
//-------------------------------------------------------------------
typedef enum
{
	SETPARTICLE_MOVE_PLAYER = 0,	// 自機の動き
	SETPARTICLE_MOVE_ENEMY,			// 敵の動き
	SETPARTICLE_MAX,
}SETPARTICLE;

//-------------------------------------------------------------------
// プロトタイプ宣言
//-------------------------------------------------------------------
void SetMoveOrbit(D3DXVECTOR3 pos, D3DXVECTOR3 move, SETPARTICLE type);	// キャラクターの軌道

#endif
