//==============================================================================================================
//
// カメラ背景ヘッダー (camera_bg.h)
// Author:Itsuki Takaiwa
//
//==============================================================================================================
#ifndef _CAMERABG_H_
#define _CAMERABG_H_

#include "main.h"

//--------------------------------------------------------------------------------------------------------------
// プロトタイプ宣言
//--------------------------------------------------------------------------------------------------------------
HRESULT InitCameraBg(void); // カメラ背景の初期化処理
void UpdateCameraBg(void);	// カメラ背景の更新処理
void UninitCameraBg(void);	// カメラの終了処理
void DrawCameraBg(void);	// カメラの描画処理

#endif