//==============================================================================================================
//
// ランキングヘッダー (ranking.h)
// Author:Itsuki Takaiwa
//
//==============================================================================================================
#ifndef _RANKING_H_
#define _RANKING_H_

#include "main.h"

//--------------------------------------------------------------------------------------------------------------
// プロトタイプ宣言
//--------------------------------------------------------------------------------------------------------------
HRESULT InitRanking(void);			// ランキングの初期化処理
void UninitRanking(void);			// ランキングの終了処理
void UpdateRanking(void);			// ランキングの更新処理
void DrawRanking(void);				// ランキングの描画処理

#endif
