//==============================================================================================================
//
// ランキング (ranking.h)
// Author:Itsuki Takaiwa
//
//==============================================================================================================
#include "ranking.h"
#include "ranking_bg.h"
#include "ranking_logo.h"
#include "ranking_rank.h"
#include "ranking_score.h"
#include "input.h"
#include "gamepad.h"
#include "fade.h"
#include "sound.h"
#include "2Deffect.h"
#include "setparticle.h"

//--------------------------------------------------------------------------------------------------------------
// ランキングの初期化処理
// 引数		：void		- 何もなし
// 返り値	：HRESULT	- 頂点バッファを生成できたかどうか返す
//--------------------------------------------------------------------------------------------------------------
HRESULT InitRanking(void)
{
	// ランキング背景の初期化
	InitRankingBg();

	// ランキングロゴの初期化
	InitRankingLogo();

	// ランキング順位の初期化
	InitRankingRank();

	// ランキングスコアの初期化
	InitRankingScore();
	
	// エフェクトの初期化処理
	Init2DEffect();

	// サウンド
	PlaySound(SOUND_LABEL_RANKING);

	return S_OK;
}

//--------------------------------------------------------------------------------------------------------------
// ランキングの終了処理
// 引数		：void	- 何もなし
// 返り値	：void	- 何も返さない
//--------------------------------------------------------------------------------------------------------------
void UninitRanking(void)
{
	// ランキング背景の初期化
	UninitRankingBg();

	// ランキングロゴの初期化
	UninitRankingLogo();

	// ランキング順位の初期化
	UninitRankingRank();

	// ランキングスコアの初期化
	UninitRankingScore();

	// エフェクトの初期化処理
	Uninit2DEffect();
}

//--------------------------------------------------------------------------------------------------------------
// ランキングの更新処理
// 引数		：void	- 何もなし
// 返り値	：void	- 何も返さない
//--------------------------------------------------------------------------------------------------------------
void UpdateRanking(void)
{
	// ランキング背景の初期化
	UpdateRankingBg();

	// ランキングロゴの初期化
	UpdateRankingLogo();

	// ランキング順位の初期化
	UpdateRankingRank();

	// ランキングスコアの初期化
	UpdateRankingScore();

	// エフェクトの初期化処理
	Update2DEffect();
}

//--------------------------------------------------------------------------------------------------------------
// ランキングの描画処理
// 引数		：void	- 何もなし
// 返り値	：void	- 何も返さない
//--------------------------------------------------------------------------------------------------------------
void DrawRanking(void)
{
	// ランキング背景の初期化
	DrawRankingBg();

	// ランキングロゴの初期化
	DrawRankingLogo();

	// エフェクトの初期化処理
	Draw2DEffect();

	// ランキング順位の初期化
	DrawRankingRank();

	// ランキングスコアの初期化
	DrawRankingScore();
}