//==============================================================================================================
//
// ランキングの順位ヘッダー (ranking_rank.h)
// Author:Itsuki Takaiwa
//
//==============================================================================================================
#ifndef _RANKINGRANK_H_
#define _RANKINGRANK_H_

#include "main.h"

//--------------------------------------------------------------------------------------------------------------
// プロトタイプ宣言
//--------------------------------------------------------------------------------------------------------------
HRESULT InitRankingRank(void);			// ランキング順位の初期化処理
void UninitRankingRank(void);			// ランキング順位の終了処理
void UpdateRankingRank(void);			// ランキング順位の更新処理
void DrawRankingRank(void);				// ランキング順位の描画処理

#endif