//==============================================================================================================
//
// ランキングロゴヘッダー (ranking_logo.h)
// Author:Itsuki Takaiwa
//
//==============================================================================================================
#ifndef _RANKINGLOGO_H_
#define _RANKINGLOGO_H_

#include "main.h"

//--------------------------------------------------------------------------------------------------------------
// プロトタイプ宣言
//--------------------------------------------------------------------------------------------------------------
HRESULT InitRankingLogo(void);			// ランキングロゴの初期化処理
void UninitRankingLogo(void);			// ランキングロゴの終了処理
void UpdateRankingLogo(void);			// ランキングロゴの更新処理
void DrawRankingLogo(void);				// ランキングロゴの描画処理

#endif