//==============================================================================================================
//
// ランキングスコアヘッダー (ranking_score.h)
// Author:Itsuki Takaiwa
//
//==============================================================================================================
#ifndef _RANKINGSCORE_H_
#define _RANKINGSCORE_H_

#include "main.h"

//--------------------------------------------------------------------------------------------------------------
// プロトタイプ宣言
//--------------------------------------------------------------------------------------------------------------
HRESULT InitRankingScore(void);			// ランキングスコアの初期化処理
void UninitRankingScore(void);			// ランキングスコアの終了処理
void UpdateRankingScore(void);			// ランキングスコアの更新処理
void DrawRankingScore(void);			// ランキングスコアの描画処理

void Ranking(void);						// ランキングの入れ替え
int GetFlashNumber(void);				// 点滅するスコアが何番目か取得

#endif