//==============================================================================================================
//
// タイトル背景ヘッダー (title_bg.h)
// Author:Itsuki Takaiwa
//
//==============================================================================================================
#ifndef _TITLEBG_H_
#define _TITLEBG_H_

#include "main.h"

//----------------------------------------------------------------------------------------------------------------
// プロトタイプ宣言
//----------------------------------------------------------------------------------------------------------------
HRESULT InitTitleBg(void);				// タイトル背景の初期化処理
void UninitTitleBg(void);				// タイトル背景の終了処理
void UpdateTitleBg(void);				// タイトル背景の更新処理
void DrawTitleBg(void);					// タイトル背景の描画処理

void SetTexUVTitleBg(int nCntTitleBg); // タイトル背景の頂点座標の設定

#endif