//==============================================================================================================
//
// チュートリアル画像ヘッダー (tutorial_image.h)
// Author:Itsuki Takaiwa
//
//==============================================================================================================
#ifndef _TUTORIALIMAGE_H_
#define _TUTORIALIMAGE_H_

#include "main.h"

//--------------------------------------------------------------------------------------------------------------
// マクロ定義
//--------------------------------------------------------------------------------------------------------------
#define MAX_TUTORIAL_IMAGE		(4)						// 画像の最大数

//----------------------------------------------------------------------------------------------------------------
// プロトタイプ宣言
//----------------------------------------------------------------------------------------------------------------
HRESULT InitTutorialImage(void);	// チュートリアル画像の初期化処理
void UninitTutorialImage(void);		// チュートリアル画像の終了処理
void UpdateTutorialImage(void);		// チュートリアル画像の更新処理
void DrawTutorialImage(void);		// チュートリアル画像の描画処理

int GetPointImage(void);			// チュートリアル画像が何番目か引き渡す

#endif