//==============================================================================================================
//
// チュートリアルマーカーヘッダー (tutorial_marker.h)
// Author:Itsuki Takaiwa
//
//==============================================================================================================
#ifndef _TUTORIALMARKER_H_
#define _TUTORIALMARKER_H_

#include "main.h"

//----------------------------------------------------------------------------------------------------------------
// プロトタイプ宣言
//----------------------------------------------------------------------------------------------------------------
HRESULT InitTutorialMarker(void);			// チュートリアルマーカーの初期化処理
void UninitTutorialMarker(void);			// チュートリアルマーカーの終了処理
void UpdateTutorialMarker(void);			// チュートリアルマーカーの更新処理
void DrawTutorialMarker(void);				// チュートリアルマーカーの描画処理

void SetColTutorialMarker(int nCntMarker);	// チュートリアルマーカーの色の設定
int GetPointMarker(void);					// マーカーの位置を取得

#endif