//-----------------------------------------------------------------
//
// UI背景 (ui.cpp)
// Author:Itsuki Takaiwa
//
//-----------------------------------------------------------------
#include "ui.h"
#include "score.h"
#include "timer.h"
#include "camera_bg.h"

//-----------------------------------------------------------------
// UIの初期化処理
//-----------------------------------------------------------------
void InitUi(void)
{
	// スコアの初期化
	InitScore();

	// タイマーの初期化処理
	InitTimer();

	// カメラ背景の初期化
	InitCameraBg();
}

//-----------------------------------------------------------------
// UIの終了処理
//-----------------------------------------------------------------
void UninitUi(void)
{
	// カメラ背景の終了処理
	UninitCameraBg();

	// タイマーの終了処理
	UninitTimer();

	// スコアの終了処理
	UninitScore();
}

//-----------------------------------------------------------------
// UIの更新処理
//-----------------------------------------------------------------
void UpdateUi(void)
{
	// スコアの更新処理
	UpdateScore();

	// タイマーの更新処理
	UpdateTimer();

	// カメラ背景の更新処理
	UpdateCameraBg();
}


//-----------------------------------------------------------------
// UIの描画処理
//-----------------------------------------------------------------
void DrawUi(void)
{
	// スコアの描画処理
	DrawScore();

	// タイマーの描画処理
	DrawTimer();

	// カメラ背景の描画処理
	DrawCameraBg();
}