//==============================================================================================================
//
// UI背景 (ui.cpp)
// Author:Itsuki Takaiwa
//
//==============================================================================================================
#include "ui.h"
#include "score.h"
#include "timer.h"
#include "camera_bg.h"
#include "count_down.h"

//--------------------------------------------------------------------------------------------------------------
// UIの初期化処理
// 引数		：void		- 何もなし
// 返り値	：HRESULT	- 頂点バッファを生成できたかどうか返す
//--------------------------------------------------------------------------------------------------------------
HRESULT InitUi(void)
{
	// カウントダウンの初期化処理
	InitCountDown();

	// スコアの初期化
	InitScore();

	// タイマーの初期化処理
	InitTimer();

	// カメラ背景の初期化
	InitCameraBg();

	return S_OK;
}

//--------------------------------------------------------------------------------------------------------------
// UIの終了処理
// 引数		：void	- 何もなし
// 返り値	：void	- 何も返さない
//--------------------------------------------------------------------------------------------------------------
void UninitUi(void)
{
	// カメラ背景の終了処理
	UninitCameraBg();

	// タイマーの終了処理
	UninitTimer();

	// スコアの終了処理
	UninitScore();

	// カウントダウンの終了処理
	UninitCountDown();
}

//--------------------------------------------------------------------------------------------------------------
// UIの更新処理
// 引数		：void	- 何もなし
// 返り値	：void	- 何も返さない
//--------------------------------------------------------------------------------------------------------------
void UpdateUi(void)
{
	// カウントダウンが終わったかどうか取得
	bool bFinishCountDown = GetFinishCountDown();

	// カウントダウンの更新処理
	UpdateCountDown();

	if (bFinishCountDown == true)
	{
		// スコアの更新処理
		UpdateScore();

		// タイマーの更新処理
		UpdateTimer();

		// カメラ背景の更新処理
		UpdateCameraBg();
	}
}


//--------------------------------------------------------------------------------------------------------------
// UIの描画処理
// 引数		：void	- 何もなし
// 返り値	：void	- 何も返さない
//--------------------------------------------------------------------------------------------------------------
void DrawUi(void)
{
	// カウントダウンの描画処理
	DrawCountDown();

	// スコアの描画処理
	DrawScore();

	// タイマーの描画処理
	DrawTimer();

	// カメラ背景の描画処理
	DrawCameraBg();
}