//-------------------------------------------------------------------
//
// 操作説明ヘッダー (oe_bg.h)
// Author:Itsuki Takaiwa
//
//-------------------------------------------------------------------
#ifndef _OEBG_H_
#define _OEBG_H_

#include "main.h"

//-------------------------------------------------------------------
// プロトタイプ宣言
//-------------------------------------------------------------------
HRESULT InitOe(void); // 操作説明の初期化処理
void UninitOe(void);  // 操作説明の終了処理
void UpdateOe(void);  // 操作説明の更新処理
void DrawOe(void);	  // 操作説明の描画処理

#endif
