//-------------------------------------------------------------------
//
// チュートリアルヘッダー (tutorial.h)
// Author:Itsuki Takaiwa
//
//-------------------------------------------------------------------
#ifndef _TUTORIAL_H_
#define _TUTORIAL_H_

#include "main.h"

//-------------------------------------------------------------------
// プロトタイプ宣言
//-------------------------------------------------------------------
HRESULT InitTutorial(void);				// タイトルの初期化処理
void UninitTutorial(void);					// タイトルの終了処理
void UpdateTutorial(void);					// タイトルの更新処理
void DrawTutorial(void);					// タイトルの描画処理

#endif
