//-----------------------------------------------------------------
//
// タイトル画面の背景 (titlee_bg.cpp)
// Author:Itsuki Takaiwa
//
//-----------------------------------------------------------------
#include "title_bg.h"
#include "bg.h"
#include "block.h"
#include "bear.h"
#include "wood.h"
#include "wood_back.h"
#include "crow.h"

//-----------------------------------------------------------------
// タイトル背景の初期化処理
//-----------------------------------------------------------------
HRESULT InitTitleBg(void)
{
	// 背景の初期化処理
	InitBg();

	// カラスの初期化処理
	InitCrow();

	// 木の裏の初期化処理
	InitWoodBack();

	// ブロックの初期化処理
	InitBlock();

	// ブロックの配置
	SetBlockInfo(MODESTATE_TITLE);

	return S_OK;
}

//-----------------------------------------------------------------
// タイトル背景の終了処理
//-----------------------------------------------------------------
void UninitTitleBg(void)
{
	// ブロックの終了処理
	UninitBlock();

	// 木の裏の終了処理
	UninitWoodBack();

	// カラスの終了処理
	UninitCrow();

	// 背景の終了処理
	UninitBg();
}

//-----------------------------------------------------------------
// タイトル背景の更新処理
//-----------------------------------------------------------------
void UpdateTitleBg(void)
{
	// 背景の更新処理
	UpdateBg();

	// カラスの更新処理
	UpdateCrow();

	// 木の裏の更新処理
	UpdateWoodBack();

	// ブロックの更新処理
	UpdateBlock();
}

//-----------------------------------------------------------------
// タイトル背景の描画処理
//-----------------------------------------------------------------
void DrawTitleBg(void)
{
	// 背景の描画処理
	DrawBg();

	// カラスの描画処理
	DrawCrow();

	// 木の裏の描画処理
	DrawWoodBack();

	// ブロックの描画処理
	DrawBlock();
}