//-----------------------------------------------------------------
//
// UI (ui.cpp)
// Author:Itsuki Takaiwa
//
//-----------------------------------------------------------------
#include "ui.h"
#include "score.h"
#include "score_bg.h"
#include "hidden_score.h"
#include "player_marker.h"
#include "point.h"


//-----------------------------------------------------------------
// UIの初期化処理
//-----------------------------------------------------------------
HRESULT InitUI(void)
{
	// ポイントの初期化処理
	InitPoint();

	// プレイヤーマーカーの初期化処理
	InitPlayerMarker();

	// スコア背景の初期化処理
	InitScoreBg();

	// スコアの初期化処理
	InitScore();
	
	// はてねマークの初期化処理
	InitHiddenScore();

	return S_OK;
}

//-----------------------------------------------------------------
// UIの終了処理
//-----------------------------------------------------------------
void UninitUI(void)
{
	// はてなマークの終了処理
	UninitHiddenScore();

	// スコアの終了処理
	UninitScore();

	// スコア背景の終了処理
	UninitScoreBg();

	// プレイヤーマーカーの終了処理
	UninitPlayerMarker();

	// ポイントの終了処理
	UninitPoint();
}

//-----------------------------------------------------------------
// UIの更新処理
//-----------------------------------------------------------------
void UpdateUI(void)
{
	// ポイントの更新処理
	UpdatePoint();

	// プレイヤーマーカーの更新処理
	UpdatePlayerMarker();

	// スコアの更新処理
	UpdateScore();

	// はてなマークの更新処理
	UpdateHiddenScore();
}

//-----------------------------------------------------------------
// UIの描画処理
//-----------------------------------------------------------------
void DrawUI(void)
{
	// ポイントの描画処理
	DrawPoint();

	// プレイヤーマーカーの描画処理
	DrawPlayerMarker();

	// スコア背景の描画処理
	DrawScoreBg();

	// スコアの描画処理
	DrawScore();

	// はてなマークの描画処理
	DrawHiddenScore();
}