//-------------------------------------------------------------------
//
// ゲージヘッダー (gauge.h)
// Author:Itsuki Takaiwa
//
//-------------------------------------------------------------------
#ifndef _GAUGE_H_
#define _GAUGE_H_

#include "main.h"

//-------------------------------------------------------------------
// プロトタイプ宣言
//-------------------------------------------------------------------
HRESULT InitGauge(void); // ゲージの初期化処理
void UninitGauge(void);  // ゲージの終了処理
void UpdateGauge(void);	 // ゲージの更新処理
void DrawGauge(void);	 // ゲージの描画処理
bool GetRemove(void);	 // ゲージの減少値の情報

#endif
