//-----------------------------------------------------------------
//
// UI背景 (ui.cpp)
// Author:Itsuki Takaiwa
//
//-----------------------------------------------------------------
#include "ui.h"
#include "uibg.h"
#include "score.h"
#include "item.h"
#include "gauge.h"
#include "bulletcol.h"

//-----------------------------------------------------------------
// UIの初期化処理
//-----------------------------------------------------------------
void InitUi(void)
{
	// UIの初期化処理
	InitUibg();

	// スコアの初期化
	InitScore();

	// ゲージの初期化処理
	InitGauge();

	// アイテムの初期化
	InitItem();

	// 弾の色確認の初期化処理
	InitBulletcol();

}

//-----------------------------------------------------------------
// UIの終了処理
//-----------------------------------------------------------------
void UninitUi(void)
{
	// 弾の色確認の終了処理
	UninitBulletcol();

	// アイテムの終了処理
	UninitItem();

	// ゲージの終了処理
	UninitGauge();

	// スコアの終了処理
	UninitScore();

	// UIの終了処理
	UninitUibg();
}

//-----------------------------------------------------------------
// UIの更新処理
//-----------------------------------------------------------------
void UpdateUi(void)
{
	// スコアの更新処理
	UpdateScore();

	// ゲージの更新処理
	UpdateGauge();

	// アイテムの更新処理
	UpdateItem();

	// 弾の色確認の更新処理
	UpdateBulletcol();
}


//-----------------------------------------------------------------
// UIの描画処理
//-----------------------------------------------------------------
void DrawUi(void)
{
	// UIの描画処理
	DrawUibg();

	// スコアの描画処理
	DrawScore();

	// ゲージの描画処理
	DrawGauge();

	// アイテムの描画処理
	DrawItem();

	// 弾の色確認の描画処理
	DrawBulletcol();
}